
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ЗаказПокупателя.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	//++ Арсеньева Дипломный проект 22.11.2025
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатурыРаботыСпециалиста.Получить();
	НоменклатураАбоненскаяПлата = Константы.ВКМ_НоменклатураАбоненскаяПлата.Получить();
	
	Для Каждого Строка Из Товары Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		
		Если Строка.Номенклатура = НоменклатураРаботыСпециалиста Тогда 
			
			Движение.КоличествоЧасов = Строка.Количество;
			Движение.СуммаЗаВыполненныеРаботы = Строка.Сумма;
			
		ИначеЕсли  Строка.Номенклатура = НоменклатураАбоненскаяПлата Тогда 
			Движение.АбоненскаяПлата = Строка.Сумма;
		Иначе		
			
			Продолжить;
			
		КонецЕсли;
		
		Движение.СуммаВыставленоКлиенту = Движение.СуммаЗаВыполненныеРаботы + Движение.АбоненскаяПлата;
		
	КонецЦикла;
	//--
	
КонецПроцедуры

//++ Арсеньева Дипломный проект 22.11.2025
Процедура ВыполнитьАвтозаполнение()Экспорт
	
	НоменклатураАбоненскаяПлата = Константы.ВКМ_НоменклатураАбоненскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатурыРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбоненскаяПлата) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить константу: НоменклатураАбоненскаяПлата";
		Возврат;
	КонецЕсли; 
	
	Если Не  ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить константу: НоменклатураРаботыСпециалиста";
		Возврат;
	КонецЕсли;
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбоненскойПлаты, 0) КАК СуммаАбоненскойПлаты,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход КАК ЧасыКОплате,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаЗаВыполненныеРаботыПриход, 0) КАК СуммаЗаВыполненныеРаботы
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора < &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора > &КонецПериода
	|	И ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СуммаАбоненскойПлаты <> 0 Тогда
			НоваяСтрока1 = Товары.Добавить();
			НоваяСтрока1.Номенклатура = НоменклатураАбоненскаяПлата;
			НоваяСтрока1.Сумма = Выборка.СуммаАбоненскойПлаты;
		Иначе Возврат;
		КонецЕсли;
		
		Если Выборка.СуммаЗаВыполненныеРаботы <> 0 Тогда
			НоваяСтрока2 = Товары.Добавить();
			НоваяСтрока2.Номенклатура = НоменклатураРаботыСпециалиста;
			НоваяСтрока2.Количество = Выборка.ЧасыКОплате;
			НоваяСтрока2.Сумма = Выборка.СуммаЗаВыполненныеРаботы;
		Иначе Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//--

#КонецОбласти

#КонецЕсли
