
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
			Объект.ДатаПроведенияРабот = Параметры.Дата;
			Объект.ВремяНачалаРабот = Параметры.ВремяНачалаРабот;
			Объект.ВремяОкончанияРабот = Параметры.ВремяОкончанияРабот;
			Объект.Специалист = Параметры.Специалист;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Документ Обслуживание клинтов записан");
	
КонецПроцедуры

#КонецОбласти



