	
#Область СлужебныеПроцедурыИФункции 

Функция СозданиеСпискаНаСервере(НачалоПериода, КонецПериода, СоздатьРеализацию) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =                    
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДанныеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора < &НачалоПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора > &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДанныеДокументаРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДоговора.Ссылка КАК Договор,
	|	ВТ_ДанныеДоговора.Организация КАК Организация,
	|	ВТ_ДанныеДоговора.Контрагент КАК Контрагент,
	|	ВТ_ДанныеДокументаРеализация.Ссылка КАК Реализация,
	|	ВТ_ДанныеДокументаРеализация.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ВТ_ДанныеДоговора КАК ВТ_ДанныеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументаРеализация КАК ВТ_ДанныеДокументаРеализация
	|		ПО ВТ_ДанныеДоговора.Ссылка = ВТ_ДанныеДокументаРеализация.Договор";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивРеализаций = Новый Массив;
	
	Пока Результат.Следующий() Цикл                
		
		РеализацииСтруктура = Новый Структура;
		Если СоздатьРеализацию Тогда
			Если Не ЗначениеЗаполнено(Результат.Реализация) Тогда
				НоваяРеализация = СозданиеРеализации(Результат, КонецПериода);
				РеализацииСтруктура.Вставить("Договор", Результат.Договор);
				РеализацииСтруктура.Вставить("Реализация", НоваяРеализация);
			Иначе
				РеализацииСтруктура.Вставить("Договор", Результат.Договор);
				РеализацииСтруктура.Вставить("Реализация", Результат.Реализация);
			КонецЕсли;
		Иначе
			РеализацииСтруктура.Вставить("Договор", Результат.Договор);
			РеализацииСтруктура.Вставить("Реализация", Результат.Реализация);
			
			МассивРеализаций.Добавить(РеализацииСтруктура);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРеализаций;	
	
КонецФункции

Функция СозданиеРеализации (Результат, Дата) Экспорт
	
	НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НоваяРеализация.Дата = КонецДня(Дата);
	НоваяРеализация.Организация = Результат.Организация;
	НоваяРеализация.Контрагент = Результат.Контрагент;
	НоваяРеализация.Договор = Результат.Договор; 
	НоваяРеализация.ВыполнитьАвтозаполнение();
	НоваяРеализация.СуммаДокумента = НоваяРеализация.Товары.Итог("Сумма");
	НоваяРеализация.Комментарий = "Массовое создание Актов";
	
	Если НоваяРеализация.ПроверитьЗаполнение() Тогда 
		
		Попытка
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Проведение не возможно");
			ЗаписьЖурналаРегистрации("ОБРАБОТКА: Массовое создание Актов Отменено");
		КонецПопытки;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось создать документ по Договору: %1. Заполните все обязательные данные",
		Результат.Договор));
		
	КонецЕсли;
	
	Возврат НоваяРеализация.Ссылка;
		
КонецФункции

#КонецОбласти
	
