
//++ Арсеньева Дипломный проект 22.11.2025
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыАбоненскогоДоговора();	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ДобавитьРеквизитыАбоненскогоДоговора();	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьРеквизитыАбоненскогоДоговора()
			
	//Добавляем на форму реквизит ВКМ_НачалоДействияДоговора, в группу ГруппаДействиеДоговора	
	Если Элементы.Найти("ВКМ_НачалоДействияДоговора") = Неопределено Тогда
		
		//Добавляем на форму группу ГруппаДействиеДоговора 
		ЭлементГруппаДействиеДоговора = Элементы.Вставить("ГруппаДействиеДоговора", Тип("ГруппаФормы"));
		ЭлементГруппаДействиеДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаДействиеДоговора.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаДействиеДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		//Добавляем на форму реквизит ВКМ_НачалоДействияДоговора
		ЭлементВКМ_НачалоДействияДоговора  = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"),
		Элементы.ГруппаДействиеДоговора);
		ЭлементВКМ_НачалоДействияДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		ЭлементВКМ_НачалоДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементВКМ_НачалоДействияДоговора.Заголовок = "Начало действия договора(ВКМ)";
	КонецЕсли;
	
	//Добавляем на форму реквизит ВКМ_ОкончаниеДействияДоговора, в группу  ГруппаДействиеДоговора 
	Если Элементы.Найти("ВКМ_ОкончаниеДействияДоговора") = Неопределено Тогда
		
		ЭлементВКМ_ОкончаниеДействияДоговора = Элементы.Вставить("ВКМ_ОкончаниеДействияДоговора", Тип("ПолеФормы"),
		Элементы.ГруппаДействиеДоговора);
		ЭлементВКМ_ОкончаниеДействияДоговора.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
		ЭлементВКМ_ОкончаниеДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементВКМ_ОкончаниеДействияДоговора.Заголовок = "Окончание действия договора(ВКМ)";
		
	КонецЕсли;
	
	//Добавляем на форму реквизит ВКМ_СуммаАбоненскойПлаты, в группу ГруппаОплата	
	Если Элементы.Найти("ВКМ_СуммаАбоненскойПлаты") = Неопределено Тогда
		
		//Добавляем группу ГруппаОплата
		ЭлементГруппаОплата = Элементы.Вставить("ГруппаОплата", Тип("ГруппаФормы"));
		ЭлементГруппаОплата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаОплата.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		//Добавляем на форму реквизит ВКМ_СуммаАбоненскойПлаты
		ЭлементВКМ_СуммаАбоненскойПлаты  = Элементы.Добавить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"),
		Элементы.ГруппаОплата);
		ЭлементВКМ_СуммаАбоненскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты";
		ЭлементВКМ_СуммаАбоненскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементВКМ_СуммаАбоненскойПлаты.Заголовок = "Сумма абоненской платы(ВКМ)";
		
	КонецЕсли;
	
	//Добавляем на форму реквизит ВКМ_СтоимостьЧасаРаботы, в группу  ГруппаОплата 
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		
		ЭлементВКМ_СтоимостьЧасаРаботы = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"),
		Элементы.ГруппаОплата);
		ЭлементВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		ЭлементВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементВКМ_СтоимостьЧасаРаботы.Заголовок = "Стоимость работы за час(ВКМ)";
		
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание  Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти
// --
