
#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисленияИУдержания

&НаКлиенте
Процедура ОсновныеНачисленияИУдержанияНачислениеПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ОсновныеНачисленияИУдержания.ТекущиеДанные;
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ИзмененнаяСтрока.Начисление = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда 
		
		ИзмененнаяСтрока.СуммаНачисления = ВКМ_ЗаполнениеНачислениеЗарплатыВызовСервера.ЗаполнениеОкладаСотрудника(Объект.Дата, ИзмененнаяСтрока.Сотрудник);
	ИначеЕсли
		
		ИзмененнаяСтрока.Начисление = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") Тогда
		ИзмененнаяСтрока.СуммаНачисления = 0;
		
		ПересчитатьНДФЛ(ИзмененнаяСтрока);
		
	КонецЕсли;
	
	ПересчитатьНДФЛ(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияИУдержанияУдержаниеПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ОсновныеНачисленияИУдержания.ТекущиеДанные;
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПересчитатьНДФЛ(ИзмененнаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНДФЛ()
	
	Возврат Константы.ВКМ_НДФЛ.Получить();
	
КонецФункции 

&НаКлиенте
Процедура ПересчитатьНДФЛ(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Удержание = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_Удержания.НДФЛ") Тогда
		
		НДФЛ = ПолучитьНДФЛ();
		
		ИзмененнаяСтрока.СуммаУдержания = ИзмененнаяСтрока.СуммаНачисления / 100 * НДФЛ;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

