
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Год < Год(Дата) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Год не может быть менее, текущего года";
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;

	// регистр ВКМ_ГрафикОтпусков 
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата(Год, 1,1);
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.Год = Год;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
		Движение.ДнейОтпуска = (НачалоДня(ТекСтрокаОтпускаСотрудников.ДатаОкончания) - НачалоДня(ТекСтрокаОтпускаСотрудников.ДатаНачала)) / 86400 + 1;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

