#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	СоздатьРеализацию = Ложь;
	ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРеализации(Команда)
	
	СоздатьРеализацию = Истина;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
 
&НаСервере
Функция ВыполнениеНаСервере(СоздатьРеализацию)
	
    Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеСпискаНаСервере", 
												Объект.НачалоПериода,Объект.КонецПериода,СоздатьРеализацию);
		
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда		
		МассивРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);	  
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивРеализаций Цикл
		
		НоваяСтрока = Объект.Реализации.Добавить();
		НоваяСтрока.Договор = ЭлементМассива.Договор;
		НоваяСтрока.ДокументРеализация = ЭлементМассива.Реализация;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти



