#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаСообщенийВТелеграм() Экспорт
	Параметры1 = Новый Структура("АдресТелеграм, Token, IdGroup");
	Параметры1.АдресТелеграм = "api.telegram.org";
	Параметры1.Token = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	Параметры1.IdGroup = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
		
	Пока Выборка.Следующий() Цикл
		
		Сообщение = Выборка.ТекстСообщения;

		СтрокаПараметров = "chat_id="+Параметры1.IdGroup+"&parse_mode=html&text="+Сообщение;

		Если Не ВыполнитьHTTPЗапрос("GET",Параметры1.АдресТелеграм,"/bot"+Параметры1.Token+"/sendMessage",СтрокаПараметров) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Сообщение не отправлено";
			Сообщение.Сообщить();
			Прервать;
		Иначе		
			ЭлементДляУдаления = Выборка.Ссылка.ПолучитьОбъект();
			ЭлементДляУдаления.Удалить();
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры 

Функция ВыполнитьHTTPЗапрос(Метод,АдресСайта,АдресРесурса,СтрокаПараметров);
			
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded"); 
	HTTPЗапрос.Заголовки.Вставить(Метод + " /enter HTTP/1.1");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, "utf-8");
	HTTPЗапрос.АдресРесурса = АдресРесурса;
	
	
	Соединение1 = Новый HTTPСоединение (АдресСайта, 443,,,,30, Новый ЗащищенноеСоединениеOpenSSL());
	
	ОтветHTTP = Соединение1.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		СтруктураСобытий = Новый Структура;
		СтруктураСобытий.Вставить("ИмяСобытия");
		СтруктураСобытий.Вставить("ПредставлениеУровня");
		СтруктураСобытий.Вставить("Комментарий");
		СтруктураСобытий.Вставить("ДатаСобытия");
		СтруктураСобытий.ИмяСобытия = "Ошибка HTTP-Запроса";
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";
		СтруктураСобытий.Комментарий = "Ошибка HTTP-Запроса: " + ОтветHTTP.КодСостояния;
		СтруктураСобытий.ДатаСобытия = ТекущаяДатаСеанса();
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		
		СообщениеОтправлено = Ложь;
		
	Иначе
		
		СообщениеОтправлено = Истина;
			
	КонецЕсли;
	
	Возврат СообщениеОтправлено;
			
 КонецФункции
 
 #КонецОбласти

